Basic Router configuration

Enter global configuration mode to configure the name of the router as “R1”.

Router>enable
Router#configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)#hostname R1

Configure 'class' as the secret password.
R1(config)#enable secret class

Configure 'cisco' as the console line password, require users to login, and return to global configuration mode.
R1(config)#line console 0
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#exit

For vty lines 0 through 4, configure 'cisco' as the password, require users to login, enable SSH and Telnet access, and return to global configuration mode.
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#transport input ssh telnet
R1(config-line)#exit

Encrypt all clear text passwords.
R1(config)#service password-encryption

Enter the banner 'Authorized Access Only!' and use # as the delimiting character.
R1(config)#banner motd #Authorized Access Only!#

Exit global configuration mode.
R1(config)#exit

R1#
You have successfully configured the initial settings on router R1.


------------------------------------------

Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#exit
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#banner motd #Unauthorized access is strictly prohibited.#
R1(config)#service password-encryption
R1(config)#enable secret itsasecret
R1(config)#line con 0
R1(config-line)#password letmein
R1(config-line)#login
R1(config-line)#exit
	
R1(config)#exit
R1#

R1#show running-config
Building configuration...

Current configuration : 848 bytes
!
version 15.4
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname R1
!
!
!
enable secret 5 $1$mERr$ILwq/b7kc.7X/ejA4Aosn0
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface GigabitEthernet0/0/0
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface GigabitEthernet0/0/1
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Serial0/1/0
 no ip address
 clock rate 2000000
 shutdown
!
interface Serial0/1/1
 no ip address
 clock rate 2000000
 shutdown
!
interface Vlan1
 no ip address
 shutdown
!
ip classless
!
ip flow-export version 9
!
!
!
no cdp run
!
banner motd ^CUnauthorized access is strictly prohibited.^C
!
!
!
!
line con 0
 password 7 082D495A041C0C19
 login
!
line aux 0
!
line vty 0 4
 login
!
!
!
end

